MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024EFK064/mcu.h
extern volatile __ADCDATA0bits_t ADCDATA0bits __asm__ ("ADCDATA0") __attribute__((section("sfrs"), address(0xBF84B200)));
#define ADCDATA1 ADCDATA1
extern volatile uint32_t   ADCDATA1 __attribute__((section("sfrs"), address(0xBF84B204)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA1bits_t;
extern volatile __ADCDATA1bits_t ADCDATA1bits __asm__ ("ADCDATA1") __attribute__((section("sfrs"), address(0xBF84B204)));
#define ADCDATA2 ADCDATA2
extern volatile uint32_t   ADCDATA2 __attribute__((section("sfrs"), address(0xBF84B208)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA2bits_t;
extern volatile __ADCDATA2bits_t ADCDATA2bits __asm__ ("ADCDATA2") __attribute__((section("sfrs"), address(0xBF84B208)));
#define ADCDATA3 ADCDATA3
extern volatile uint32_t   ADCDATA3 __attribute__((section("sfrs"), address(0xBF84B20C)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA3bits_t;
extern volatile __ADCDATA3bits_t ADCDATA3bits __asm__ ("ADCDATA3") __attribute__((section("sfrs"), address(0xBF84B20C)));
#define ADCDATA4 ADCDATA4
extern volatile uint32_t   ADCDATA4 __attribute__((section("sfrs"), address(0xBF84B210)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA4bits_t;
extern volatile __ADCDATA4bits_t ADCDATA4bits __asm__ ("ADCDATA4") __attribute__((section("sfrs"), address(0xBF84B210)));
#define ADCDATA5 ADCDATA5
extern volatile uint32_t   ADCDATA5 __attribute__((section("sfrs"), address(0xBF84B214)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA5bits_t;
extern volatile __ADCDATA5bits_t ADCDATA5bits __asm__ ("ADCDATA5") __attribute__((section("sfrs"), address(0xBF84B214)));
#define ADCDATA6 ADCDATA6
extern volatile uint32_t   ADCDATA6 __attribute__((section("sfrs"), address(0xBF84B218)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA6bits_t;
extern volatile __ADCDATA6bits_t ADCDATA6bits __asm__ ("ADCDATA6") __attribute__((section("sfrs"), address(0xBF84B218)));
#define ADCDATA7 ADCDATA7
extern volatile uint32_t   ADCDATA7 __attribute__((section("sfrs"), address(0xBF84B21C)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA7bits_t;
extern volatile __ADCDATA7bits_t ADCDATA7bits __asm__ ("ADCDATA7") __attribute__((section("sfrs"), address(0xBF84B21C)));
#define ADCDATA8 ADCDATA8
extern volatile uint32_t   ADCDATA8 __attribute__((section("sfrs"), address(0xBF84B220)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA8bits_t;
extern volatile __ADCDATA8bits_t ADCDATA8bits __asm__ ("ADCDATA8") __attribute__((section("sfrs"), address(0xBF84B220)));
#define ADCDATA9 ADCDATA9
extern volatile uint32_t   ADCDATA9 __attribute__((section("sfrs"), address(0xBF84B224)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA9bits_t;
extern volatile __ADCDATA9bits_t ADCDATA9bits __asm__ ("ADCDATA9") __attribute__((section("sfrs"), address(0xBF84B224)));
#define ADCDATA10 ADCDATA10
extern volatile uint32_t   ADCDATA10 __attribute__((section("sfrs"), address(0xBF84B228)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA10bits_t;
extern volatile __ADCDATA10bits_t ADCDATA10bits __asm__ ("ADCDATA10") __attribute__((section("sfrs"), address(0xBF84B228)));
#define ADCDATA11 ADCDATA11
extern volatile uint32_t   ADCDATA11 __attribute__((section("sfrs"), address(0xBF84B22C)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA11bits_t;
extern volatile __ADCDATA11bits_t ADCDATA11bits __asm__ ("ADCDATA11") __attribute__((section("sfrs"), address(0xBF84B22C)));
#define ADCDATA12 ADCDATA12
extern volatile uint32_t   ADCDATA12 __attribute__((section("sfrs"), address(0xBF84B230)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA12bits_t;
extern volatile __ADCDATA12bits_t ADCDATA12bits __asm__ ("ADCDATA12") __attribute__((section("sfrs"), address(0xBF84B230)));
#define ADCDATA13 ADCDATA13
extern volatile uint32_t   ADCDATA13 __attribute__((section("sfrs"), address(0xBF84B234)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA13bits_t;
extern volatile __ADCDATA13bits_t ADCDATA13bits __asm__ ("ADCDATA13") __attribute__((section("sfrs"), address(0xBF84B234)));
#define ADCDATA14 ADCDATA14
extern volatile uint32_t   ADCDATA14 __attribute__((section("sfrs"), address(0xBF84B238)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA14bits_t;
extern volatile __ADCDATA14bits_t ADCDATA14bits __asm__ ("ADCDATA14") __attribute__((section("sfrs"), address(0xBF84B238)));
#define ADCDATA15 ADCDATA15
extern volatile uint32_t   ADCDATA15 __attribute__((section("sfrs"), address(0xBF84B23C)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA15bits_t;
extern volatile __ADCDATA15bits_t ADCDATA15bits __asm__ ("ADCDATA15") __attribute__((section("sfrs"), address(0xBF84B23C)));
#define ADCDATA16 ADCDATA16
extern volatile uint32_t   ADCDATA16 __attribute__((section("sfrs"), address(0xBF84B240)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA16bits_t;
extern volatile __ADCDATA16bits_t ADCDATA16bits __asm__ ("ADCDATA16") __attribute__((section("sfrs"), address(0xBF84B240)));
#define ADCDATA17 ADCDATA17
extern volatile uint32_t   ADCDATA17 __attribute__((section("sfrs"), address(0xBF84B244)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA17bits_t;
extern volatile __ADCDATA17bits_t ADCDATA17bits __asm__ ("ADCDATA17") __attribute__((section("sfrs"), address(0xBF84B244)));
#define ADCDATA18 ADCDATA18
extern volatile uint32_t   ADCDATA18 __attribute__((section("sfrs"), address(0xBF84B248)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA18bits_t;
extern volatile __ADCDATA18bits_t ADCDATA18bits __asm__ ("ADCDATA18") __attribute__((section("sfrs"), address(0xBF84B248)));
#define ADCDATA43 ADCDATA43
extern volatile uint32_t   ADCDATA43 __attribute__((section("sfrs"), address(0xBF84B2AC)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA43bits_t;
extern volatile __ADCDATA43bits_t ADCDATA43bits __asm__ ("ADCDATA43") __attribute__((section("sfrs"), address(0xBF84B2AC)));
#define ADCDATA44 ADCDATA44
extern volatile uint32_t   ADCDATA44 __attribute__((section("sfrs"), address(0xBF84B2B0)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA44bits_t;
extern volatile __ADCDATA44bits_t ADCDATA44bits __asm__ ("ADCDATA44") __attribute__((section("sfrs"), address(0xBF84B2B0)));
#define CM1CON CM1CON
extern volatile uint32_t   CM1CON __attribute__((section("sfrs"), address(0xBF84C000)));
typedef union {
  struct {
    uint32_t CCH:2;
    uint32_t :2;
    uint32_t CREF:1;
    uint32_t :1;
    uint32_t EVPOL:2;
    uint32_t COUT:1;
    uint32_t :4;
    uint32_t CPOL:1;
    uint32_t COE:1;
    uint32_t ON:1;
  };
  struct {
    uint32_t CCH0:1;
    uint32_t CCH1:1;
    uint32_t :4;
    uint32_t EVPOL0:1;
    uint32_t EVPOL1:1;
  };
  struct {
    uint32_t w:32;
  };
} __CM1CONbits_t;
extern volatile __CM1CONbits_t CM1CONbits __asm__ ("CM1CON") __attribute__((section("sfrs"), address(0xBF84C000)));
extern volatile uint32_t        CM1CONCLR __attribute__((section("sfrs"),address(0xBF84C004)));
extern volatile uint32_t        CM1CONSET __attribute__((section("sfrs"),address(0xBF84C008)));
extern volatile uint32_t        CM1CONINV __attribute__((section("sfrs"),address(0xBF84C00C)));
#define CM2CON CM2CON
extern volatile uint32_t   CM2CON __attribute__((section("sfrs"), address(0xBF84C010)));
typedef union {
  struct {
    uint32_t CCH:2;
    uint32_t :2;
    uint32_t CREF:1;
    uint32_t :1;
    uint32_t EVPOL:2;
    uint32_t COUT:1;
    uint32_t :4;
    uint32_t CPOL:1;
    uint32_t COE:1;
    uint32_t ON:1;
  };
  struct {
    uint32_t CCH0:1;
    uint32_t CCH1:1;
    uint32_t :4;
    uint32_t EVPOL0:1;
    uint32_t EVPOL1:1;
  };
  struct {
    uint32_t w:32;
  };
} __CM2CONbits_t;
extern volatile __CM2CONbits_t CM2CONbits __asm__ ("CM2CON") __attribute__((section("sfrs"), address(0xBF84C010)));
extern volatile uint32_t        CM2CONCLR __attribute__((section("sfrs"),address(0xBF84C014)));
extern volatile uint32_t        CM2CONSET __attribute__((section("sfrs"),address(0xBF84C018)));
extern volatile uint32_t        CM2CONINV __attribute__((section("sfrs"),address(0xBF84C01C)));
#define CMSTAT CMSTAT
extern volatile uint32_t   CMSTAT __attribute__((section("sfrs"), address(0xBF84C060)));
typedef union {
  struct {
    uint32_t C1OUT:1;
    uint32_t C2OUT:1;
    uint32_t :11;
    uint32_t SIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __CMSTATbits_t;
