MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024EFK064/mcu.h
extern volatile __CMSTATbits_t CMSTATbits __asm__ ("CMSTAT") __attribute__((section("sfrs"), address(0xBF84C060)));
extern volatile uint32_t        CMSTATCLR __attribute__((section("sfrs"),address(0xBF84C064)));
extern volatile uint32_t        CMSTATSET __attribute__((section("sfrs"),address(0xBF84C068)));
extern volatile uint32_t        CMSTATINV __attribute__((section("sfrs"),address(0xBF84C06C)));
#define ANSELB ANSELB
extern volatile uint32_t   ANSELB __attribute__((section("sfrs"), address(0xBF860100)));
typedef union {
  struct {
    uint32_t ANSB0:1;
    uint32_t ANSB1:1;
    uint32_t ANSB2:1;
    uint32_t ANSB3:1;
    uint32_t ANSB4:1;
    uint32_t ANSB5:1;
    uint32_t ANSB6:1;
    uint32_t ANSB7:1;
    uint32_t ANSB8:1;
    uint32_t ANSB9:1;
    uint32_t ANSB10:1;
    uint32_t ANSB11:1;
    uint32_t ANSB12:1;
    uint32_t ANSB13:1;
    uint32_t ANSB14:1;
    uint32_t ANSB15:1;
  };
  struct {
    uint32_t w:32;
  };
} __ANSELBbits_t;
extern volatile __ANSELBbits_t ANSELBbits __asm__ ("ANSELB") __attribute__((section("sfrs"), address(0xBF860100)));
extern volatile uint32_t        ANSELBCLR __attribute__((section("sfrs"),address(0xBF860104)));
extern volatile uint32_t        ANSELBSET __attribute__((section("sfrs"),address(0xBF860108)));
extern volatile uint32_t        ANSELBINV __attribute__((section("sfrs"),address(0xBF86010C)));
#define TRISB TRISB
extern volatile uint32_t   TRISB __attribute__((section("sfrs"), address(0xBF860110)));
typedef union {
  struct {
    uint32_t TRISB0:1;
    uint32_t TRISB1:1;
    uint32_t TRISB2:1;
    uint32_t TRISB3:1;
    uint32_t TRISB4:1;
    uint32_t TRISB5:1;
    uint32_t TRISB6:1;
    uint32_t TRISB7:1;
    uint32_t TRISB8:1;
    uint32_t TRISB9:1;
    uint32_t TRISB10:1;
    uint32_t TRISB11:1;
    uint32_t TRISB12:1;
    uint32_t TRISB13:1;
    uint32_t TRISB14:1;
    uint32_t TRISB15:1;
  };
  struct {
    uint32_t w:32;
  };
} __TRISBbits_t;
extern volatile __TRISBbits_t TRISBbits __asm__ ("TRISB") __attribute__((section("sfrs"), address(0xBF860110)));
extern volatile uint32_t        TRISBCLR __attribute__((section("sfrs"),address(0xBF860114)));
extern volatile uint32_t        TRISBSET __attribute__((section("sfrs"),address(0xBF860118)));
extern volatile uint32_t        TRISBINV __attribute__((section("sfrs"),address(0xBF86011C)));
#define PORTB PORTB
extern volatile uint32_t   PORTB __attribute__((section("sfrs"), address(0xBF860120)));
typedef union {
  struct {
    uint32_t RB0:1;
    uint32_t RB1:1;
    uint32_t RB2:1;
    uint32_t RB3:1;
    uint32_t RB4:1;
    uint32_t RB5:1;
    uint32_t RB6:1;
    uint32_t RB7:1;
    uint32_t RB8:1;
    uint32_t RB9:1;
    uint32_t RB10:1;
    uint32_t RB11:1;
    uint32_t RB12:1;
    uint32_t RB13:1;
    uint32_t RB14:1;
    uint32_t RB15:1;
  };
  struct {
    uint32_t w:32;
  };
} __PORTBbits_t;
extern volatile __PORTBbits_t PORTBbits __asm__ ("PORTB") __attribute__((section("sfrs"), address(0xBF860120)));
extern volatile uint32_t        PORTBCLR __attribute__((section("sfrs"),address(0xBF860124)));
extern volatile uint32_t        PORTBSET __attribute__((section("sfrs"),address(0xBF860128)));
extern volatile uint32_t        PORTBINV __attribute__((section("sfrs"),address(0xBF86012C)));
#define LATB LATB
extern volatile uint32_t   LATB __attribute__((section("sfrs"), address(0xBF860130)));
typedef union {
  struct {
    uint32_t LATB0:1;
    uint32_t LATB1:1;
    uint32_t LATB2:1;
    uint32_t LATB3:1;
    uint32_t LATB4:1;
    uint32_t LATB5:1;
    uint32_t LATB6:1;
    uint32_t LATB7:1;
    uint32_t LATB8:1;
    uint32_t LATB9:1;
    uint32_t LATB10:1;
    uint32_t LATB11:1;
    uint32_t LATB12:1;
    uint32_t LATB13:1;
    uint32_t LATB14:1;
    uint32_t LATB15:1;
  };
  struct {
    uint32_t w:32;
  };
} __LATBbits_t;
extern volatile __LATBbits_t LATBbits __asm__ ("LATB") __attribute__((section("sfrs"), address(0xBF860130)));
extern volatile uint32_t        LATBCLR __attribute__((section("sfrs"),address(0xBF860134)));
extern volatile uint32_t        LATBSET __attribute__((section("sfrs"),address(0xBF860138)));
extern volatile uint32_t        LATBINV __attribute__((section("sfrs"),address(0xBF86013C)));
#define ODCB ODCB
extern volatile uint32_t   ODCB __attribute__((section("sfrs"), address(0xBF860140)));
typedef union {
  struct {
    uint32_t ODCB0:1;
    uint32_t ODCB1:1;
    uint32_t ODCB2:1;
    uint32_t ODCB3:1;
    uint32_t ODCB4:1;
    uint32_t ODCB5:1;
    uint32_t ODCB6:1;
    uint32_t ODCB7:1;
    uint32_t ODCB8:1;
    uint32_t ODCB9:1;
    uint32_t ODCB10:1;
    uint32_t ODCB11:1;
    uint32_t ODCB12:1;
    uint32_t ODCB13:1;
    uint32_t ODCB14:1;
    uint32_t ODCB15:1;
  };
  struct {
    uint32_t w:32;
  };
} __ODCBbits_t;
extern volatile __ODCBbits_t ODCBbits __asm__ ("ODCB") __attribute__((section("sfrs"), address(0xBF860140)));
extern volatile uint32_t        ODCBCLR __attribute__((section("sfrs"),address(0xBF860144)));
extern volatile uint32_t        ODCBSET __attribute__((section("sfrs"),address(0xBF860148)));
extern volatile uint32_t        ODCBINV __attribute__((section("sfrs"),address(0xBF86014C)));
#define CNPUB CNPUB
extern volatile uint32_t   CNPUB __attribute__((section("sfrs"), address(0xBF860150)));
typedef union {
  struct {
    uint32_t CNPUB0:1;
    uint32_t CNPUB1:1;
    uint32_t CNPUB2:1;
    uint32_t CNPUB3:1;
    uint32_t CNPUB4:1;
    uint32_t CNPUB5:1;
    uint32_t CNPUB6:1;
    uint32_t CNPUB7:1;
    uint32_t CNPUB8:1;
    uint32_t CNPUB9:1;
    uint32_t CNPUB10:1;
    uint32_t CNPUB11:1;
    uint32_t CNPUB12:1;
    uint32_t CNPUB13:1;
    uint32_t CNPUB14:1;
    uint32_t CNPUB15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPUBbits_t;
extern volatile __CNPUBbits_t CNPUBbits __asm__ ("CNPUB") __attribute__((section("sfrs"), address(0xBF860150)));
extern volatile uint32_t        CNPUBCLR __attribute__((section("sfrs"),address(0xBF860154)));
extern volatile uint32_t        CNPUBSET __attribute__((section("sfrs"),address(0xBF860158)));
extern volatile uint32_t        CNPUBINV __attribute__((section("sfrs"),address(0xBF86015C)));
#define CNPDB CNPDB
extern volatile uint32_t   CNPDB __attribute__((section("sfrs"), address(0xBF860160)));
typedef union {
  struct {
    uint32_t CNPDB0:1;
    uint32_t CNPDB1:1;
    uint32_t CNPDB2:1;
    uint32_t CNPDB3:1;
    uint32_t CNPDB4:1;
    uint32_t CNPDB5:1;
    uint32_t CNPDB6:1;
    uint32_t CNPDB7:1;
    uint32_t CNPDB8:1;
    uint32_t CNPDB9:1;
    uint32_t CNPDB10:1;
    uint32_t CNPDB11:1;
    uint32_t CNPDB12:1;
    uint32_t CNPDB13:1;
    uint32_t CNPDB14:1;
    uint32_t CNPDB15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPDBbits_t;
extern volatile __CNPDBbits_t CNPDBbits __asm__ ("CNPDB") __attribute__((section("sfrs"), address(0xBF860160)));
extern volatile uint32_t        CNPDBCLR __attribute__((section("sfrs"),address(0xBF860164)));
extern volatile uint32_t        CNPDBSET __attribute__((section("sfrs"),address(0xBF860168)));
extern volatile uint32_t        CNPDBINV __attribute__((section("sfrs"),address(0xBF86016C)));
#define CNCONB CNCONB
extern volatile uint32_t   CNCONB __attribute__((section("sfrs"), address(0xBF860170)));
typedef union {
  struct {
    uint32_t :11;
    uint32_t EDGEDETECT:1;
    uint32_t :3;
    uint32_t ON:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNCONBbits_t;
extern volatile __CNCONBbits_t CNCONBbits __asm__ ("CNCONB") __attribute__((section("sfrs"), address(0xBF860170)));
extern volatile uint32_t        CNCONBCLR __attribute__((section("sfrs"),address(0xBF860174)));
extern volatile uint32_t        CNCONBSET __attribute__((section("sfrs"),address(0xBF860178)));
extern volatile uint32_t        CNCONBINV __attribute__((section("sfrs"),address(0xBF86017C)));
#define CNENB CNENB
extern volatile uint32_t   CNENB __attribute__((section("sfrs"), address(0xBF860180)));
typedef union {
  struct {
    uint32_t CNIEB0:1;
    uint32_t CNIEB1:1;
    uint32_t CNIEB2:1;
    uint32_t CNIEB3:1;
    uint32_t CNIEB4:1;
    uint32_t CNIEB5:1;
    uint32_t CNIEB6:1;
    uint32_t CNIEB7:1;
    uint32_t CNIEB8:1;
    uint32_t CNIEB9:1;
    uint32_t CNIEB10:1;
    uint32_t CNIEB11:1;
    uint32_t CNIEB12:1;
    uint32_t CNIEB13:1;
    uint32_t CNIEB14:1;
    uint32_t CNIEB15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNENBbits_t;
extern volatile __CNENBbits_t CNENBbits __asm__ ("CNENB") __attribute__((section("sfrs"), address(0xBF860180)));
extern volatile uint32_t        CNENBCLR __attribute__((section("sfrs"),address(0xBF860184)));
extern volatile uint32_t        CNENBSET __attribute__((section("sfrs"),address(0xBF860188)));
extern volatile uint32_t        CNENBINV __attribute__((section("sfrs"),address(0xBF86018C)));
#define CNSTATB CNSTATB
extern volatile uint32_t   CNSTATB __attribute__((section("sfrs"), address(0xBF860190)));
typedef union {
  struct {
    uint32_t CNSTATB0:1;
    uint32_t CNSTATB1:1;
    uint32_t CNSTATB2:1;
    uint32_t CNSTATB3:1;
    uint32_t CNSTATB4:1;
    uint32_t CNSTATB5:1;
    uint32_t CNSTATB6:1;
    uint32_t CNSTATB7:1;
    uint32_t CNSTATB8:1;
    uint32_t CNSTATB9:1;
    uint32_t CNSTATB10:1;
    uint32_t CNSTATB11:1;
    uint32_t CNSTATB12:1;
    uint32_t CNSTATB13:1;
    uint32_t CNSTATB14:1;
    uint32_t CNSTATB15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNSTATBbits_t;
extern volatile __CNSTATBbits_t CNSTATBbits __asm__ ("CNSTATB") __attribute__((section("sfrs"), address(0xBF860190)));
extern volatile uint32_t        CNSTATBCLR __attribute__((section("sfrs"),address(0xBF860194)));
extern volatile uint32_t        CNSTATBSET __attribute__((section("sfrs"),address(0xBF860198)));
extern volatile uint32_t        CNSTATBINV __attribute__((section("sfrs"),address(0xBF86019C)));
#define CNNEB CNNEB
extern volatile uint32_t   CNNEB __attribute__((section("sfrs"), address(0xBF8601A0)));
typedef struct {
  uint32_t CNNEB0:1;
  uint32_t CNNEB1:1;
  uint32_t CNNEB2:1;
  uint32_t CNNEB3:1;
  uint32_t CNNEB4:1;
  uint32_t CNNEB5:1;
  uint32_t CNNEB6:1;
  uint32_t CNNEB7:1;
  uint32_t CNNEB8:1;
  uint32_t CNNEB9:1;
  uint32_t CNNEB10:1;
  uint32_t CNNEB11:1;
  uint32_t CNNEB12:1;
  uint32_t CNNEB13:1;
  uint32_t CNNEB14:1;
  uint32_t CNNEB15:1;
} __CNNEBbits_t;
extern volatile __CNNEBbits_t CNNEBbits __asm__ ("CNNEB") __attribute__((section("sfrs"), address(0xBF8601A0)));
extern volatile uint32_t        CNNEBCLR __attribute__((section("sfrs"),address(0xBF8601A4)));
extern volatile uint32_t        CNNEBSET __attribute__((section("sfrs"),address(0xBF8601A8)));
extern volatile uint32_t        CNNEBINV __attribute__((section("sfrs"),address(0xBF8601AC)));
#define CNFB CNFB
extern volatile uint32_t   CNFB __attribute__((section("sfrs"), address(0xBF8601B0)));
typedef struct {
  uint32_t CNFB0:1;
  uint32_t CNFB1:1;
  uint32_t CNFB2:1;
  uint32_t CNFB3:1;
  uint32_t CNFB4:1;
  uint32_t CNFB5:1;
  uint32_t CNFB6:1;
  uint32_t CNFB7:1;
  uint32_t CNFB8:1;
  uint32_t CNFB9:1;
  uint32_t CNFB10:1;
  uint32_t CNFB11:1;
  uint32_t CNFB12:1;
  uint32_t CNFB13:1;
  uint32_t CNFB14:1;
  uint32_t CNFB15:1;
} __CNFBbits_t;
extern volatile __CNFBbits_t CNFBbits __asm__ ("CNFB") __attribute__((section("sfrs"), address(0xBF8601B0)));
extern volatile uint32_t        CNFBCLR __attribute__((section("sfrs"),address(0xBF8601B4)));
extern volatile uint32_t        CNFBSET __attribute__((section("sfrs"),address(0xBF8601B8)));
extern volatile uint32_t        CNFBINV __attribute__((section("sfrs"),address(0xBF8601BC)));
#define SRCON0B SRCON0B
extern volatile uint32_t   SRCON0B __attribute__((section("sfrs"), address(0xBF8601C0)));
typedef struct {
  uint32_t :3;
  uint32_t SR0B3:1;
  uint32_t :1;
  uint32_t SR0B5:1;
  uint32_t :2;
  uint32_t SR0B8:1;
  uint32_t SR0B9:1;
  uint32_t SR0B10:1;
  uint32_t :3;
  uint32_t SR0B14:1;
} __SRCON0Bbits_t;
extern volatile __SRCON0Bbits_t SRCON0Bbits __asm__ ("SRCON0B") __attribute__((section("sfrs"), address(0xBF8601C0)));
extern volatile uint32_t        SRCON0BCLR __attribute__((section("sfrs"),address(0xBF8601C4)));
extern volatile uint32_t        SRCON0BSET __attribute__((section("sfrs"),address(0xBF8601C8)));
extern volatile uint32_t        SRCON0BINV __attribute__((section("sfrs"),address(0xBF8601CC)));
#define SRCON1B SRCON1B
extern volatile uint32_t   SRCON1B __attribute__((section("sfrs"), address(0xBF8601D0)));
typedef struct {
  uint32_t :3;
  uint32_t SR1B3:1;
  uint32_t :1;
  uint32_t SR1B5:1;
  uint32_t :2;
  uint32_t SR1B8:1;
  uint32_t SR1B9:1;
  uint32_t SR1B10:1;
  uint32_t :3;
  uint32_t SR1B14:1;
} __SRCON1Bbits_t;
extern volatile __SRCON1Bbits_t SRCON1Bbits __asm__ ("SRCON1B") __attribute__((section("sfrs"), address(0xBF8601D0)));
extern volatile uint32_t        SRCON1BCLR __attribute__((section("sfrs"),address(0xBF8601D4)));
extern volatile uint32_t        SRCON1BSET __attribute__((section("sfrs"),address(0xBF8601D8)));
extern volatile uint32_t        SRCON1BINV __attribute__((section("sfrs"),address(0xBF8601DC)));
#define TRISC TRISC
extern volatile uint32_t   TRISC __attribute__((section("sfrs"), address(0xBF860210)));
typedef union {
  struct {
    uint32_t :12;
    uint32_t TRISC12:1;
    uint32_t TRISC13:1;
    uint32_t TRISC14:1;
    uint32_t TRISC15:1;
  };
  struct {
    uint32_t w:32;
  };
} __TRISCbits_t;
extern volatile __TRISCbits_t TRISCbits __asm__ ("TRISC") __attribute__((section("sfrs"), address(0xBF860210)));
extern volatile uint32_t        TRISCCLR __attribute__((section("sfrs"),address(0xBF860214)));
extern volatile uint32_t        TRISCSET __attribute__((section("sfrs"),address(0xBF860218)));
extern volatile uint32_t        TRISCINV __attribute__((section("sfrs"),address(0xBF86021C)));
#define PORTC PORTC
extern volatile uint32_t   PORTC __attribute__((section("sfrs"), address(0xBF860220)));
typedef union {
  struct {
    uint32_t :12;
    uint32_t RC12:1;
    uint32_t RC13:1;
    uint32_t RC14:1;
    uint32_t RC15:1;
  };
  struct {
    uint32_t w:32;
  };
} __PORTCbits_t;
extern volatile __PORTCbits_t PORTCbits __asm__ ("PORTC") __attribute__((section("sfrs"), address(0xBF860220)));
extern volatile uint32_t        PORTCCLR __attribute__((section("sfrs"),address(0xBF860224)));
extern volatile uint32_t        PORTCSET __attribute__((section("sfrs"),address(0xBF860228)));
extern volatile uint32_t        PORTCINV __attribute__((section("sfrs"),address(0xBF86022C)));
#define LATC LATC
extern volatile uint32_t   LATC __attribute__((section("sfrs"), address(0xBF860230)));
typedef union {
  struct {
    uint32_t :12;
    uint32_t LATC12:1;
    uint32_t LATC13:1;
    uint32_t LATC14:1;
    uint32_t LATC15:1;
  };
  struct {
    uint32_t w:32;
  };
} __LATCbits_t;
extern volatile __LATCbits_t LATCbits __asm__ ("LATC") __attribute__((section("sfrs"), address(0xBF860230)));
extern volatile uint32_t        LATCCLR __attribute__((section("sfrs"),address(0xBF860234)));
extern volatile uint32_t        LATCSET __attribute__((section("sfrs"),address(0xBF860238)));
extern volatile uint32_t        LATCINV __attribute__((section("sfrs"),address(0xBF86023C)));
#define ODCC ODCC
extern volatile uint32_t   ODCC __attribute__((section("sfrs"), address(0xBF860240)));
typedef union {
  struct {
    uint32_t :12;
    uint32_t ODCC12:1;
    uint32_t ODCC13:1;
    uint32_t ODCC14:1;
    uint32_t ODCC15:1;
  };
  struct {
    uint32_t w:32;
  };
} __ODCCbits_t;
extern volatile __ODCCbits_t ODCCbits __asm__ ("ODCC") __attribute__((section("sfrs"), address(0xBF860240)));
extern volatile uint32_t        ODCCCLR __attribute__((section("sfrs"),address(0xBF860244)));
extern volatile uint32_t        ODCCSET __attribute__((section("sfrs"),address(0xBF860248)));
extern volatile uint32_t        ODCCINV __attribute__((section("sfrs"),address(0xBF86024C)));
#define CNPUC CNPUC
extern volatile uint32_t   CNPUC __attribute__((section("sfrs"), address(0xBF860250)));
typedef union {
  struct {
    uint32_t :12;
    uint32_t CNPUC12:1;
    uint32_t CNPUC13:1;
    uint32_t CNPUC14:1;
    uint32_t CNPUC15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPUCbits_t;
extern volatile __CNPUCbits_t CNPUCbits __asm__ ("CNPUC") __attribute__((section("sfrs"), address(0xBF860250)));
extern volatile uint32_t        CNPUCCLR __attribute__((section("sfrs"),address(0xBF860254)));
extern volatile uint32_t        CNPUCSET __attribute__((section("sfrs"),address(0xBF860258)));
extern volatile uint32_t        CNPUCINV __attribute__((section("sfrs"),address(0xBF86025C)));
#define CNPDC CNPDC
extern volatile uint32_t   CNPDC __attribute__((section("sfrs"), address(0xBF860260)));
typedef union {
  struct {
    uint32_t :12;
    uint32_t CNPDC12:1;
    uint32_t CNPDC13:1;
    uint32_t CNPDC14:1;
    uint32_t CNPDC15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPDCbits_t;
extern volatile __CNPDCbits_t CNPDCbits __asm__ ("CNPDC") __attribute__((section("sfrs"), address(0xBF860260)));
extern volatile uint32_t        CNPDCCLR __attribute__((section("sfrs"),address(0xBF860264)));
extern volatile uint32_t        CNPDCSET __attribute__((section("sfrs"),address(0xBF860268)));
extern volatile uint32_t        CNPDCINV __attribute__((section("sfrs"),address(0xBF86026C)));
#define CNCONC CNCONC
extern volatile uint32_t   CNCONC __attribute__((section("sfrs"), address(0xBF860270)));
typedef union {
  struct {
    uint32_t :11;
    uint32_t EDGEDETECT:1;
    uint32_t :3;
    uint32_t ON:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNCONCbits_t;
