MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024EFK064/mcu.h
#define _ADCGIRQEN2_AGIEN43_POSITION             0x0000000B
#define _ADCGIRQEN2_AGIEN43_MASK                 0x00000800
#define _ADCGIRQEN2_AGIEN43_LENGTH               0x00000001

#define _ADCGIRQEN2_AGIEN44_POSITION             0x0000000C
#define _ADCGIRQEN2_AGIEN44_MASK                 0x00001000
#define _ADCGIRQEN2_AGIEN44_LENGTH               0x00000001

#define _ADCCSS1_CSS0_POSITION                   0x00000000
#define _ADCCSS1_CSS0_MASK                       0x00000001
#define _ADCCSS1_CSS0_LENGTH                     0x00000001

#define _ADCCSS1_CSS1_POSITION                   0x00000001
#define _ADCCSS1_CSS1_MASK                       0x00000002
#define _ADCCSS1_CSS1_LENGTH                     0x00000001

#define _ADCCSS1_CSS2_POSITION                   0x00000002
#define _ADCCSS1_CSS2_MASK                       0x00000004
#define _ADCCSS1_CSS2_LENGTH                     0x00000001

#define _ADCCSS1_CSS3_POSITION                   0x00000003
#define _ADCCSS1_CSS3_MASK                       0x00000008
#define _ADCCSS1_CSS3_LENGTH                     0x00000001

#define _ADCCSS1_CSS4_POSITION                   0x00000004
#define _ADCCSS1_CSS4_MASK                       0x00000010
#define _ADCCSS1_CSS4_LENGTH                     0x00000001

#define _ADCCSS1_CSS5_POSITION                   0x00000005
#define _ADCCSS1_CSS5_MASK                       0x00000020
#define _ADCCSS1_CSS5_LENGTH                     0x00000001

#define _ADCCSS1_CSS6_POSITION                   0x00000006
#define _ADCCSS1_CSS6_MASK                       0x00000040
#define _ADCCSS1_CSS6_LENGTH                     0x00000001

#define _ADCCSS1_CSS7_POSITION                   0x00000007
#define _ADCCSS1_CSS7_MASK                       0x00000080
#define _ADCCSS1_CSS7_LENGTH                     0x00000001

#define _ADCCSS1_CSS8_POSITION                   0x00000008
#define _ADCCSS1_CSS8_MASK                       0x00000100
#define _ADCCSS1_CSS8_LENGTH                     0x00000001

#define _ADCCSS1_CSS9_POSITION                   0x00000009
#define _ADCCSS1_CSS9_MASK                       0x00000200
#define _ADCCSS1_CSS9_LENGTH                     0x00000001

#define _ADCCSS1_CSS10_POSITION                  0x0000000A
#define _ADCCSS1_CSS10_MASK                      0x00000400
#define _ADCCSS1_CSS10_LENGTH                    0x00000001

#define _ADCCSS1_CSS11_POSITION                  0x0000000B
#define _ADCCSS1_CSS11_MASK                      0x00000800
#define _ADCCSS1_CSS11_LENGTH                    0x00000001

#define _ADCCSS1_CSS12_POSITION                  0x0000000C
#define _ADCCSS1_CSS12_MASK                      0x00001000
#define _ADCCSS1_CSS12_LENGTH                    0x00000001

#define _ADCCSS1_CSS13_POSITION                  0x0000000D
#define _ADCCSS1_CSS13_MASK                      0x00002000
#define _ADCCSS1_CSS13_LENGTH                    0x00000001

#define _ADCCSS1_CSS14_POSITION                  0x0000000E
#define _ADCCSS1_CSS14_MASK                      0x00004000
#define _ADCCSS1_CSS14_LENGTH                    0x00000001

#define _ADCCSS1_CSS15_POSITION                  0x0000000F
#define _ADCCSS1_CSS15_MASK                      0x00008000
#define _ADCCSS1_CSS15_LENGTH                    0x00000001

#define _ADCCSS1_CSS16_POSITION                  0x00000010
#define _ADCCSS1_CSS16_MASK                      0x00010000
#define _ADCCSS1_CSS16_LENGTH                    0x00000001

#define _ADCCSS1_CSS17_POSITION                  0x00000011
#define _ADCCSS1_CSS17_MASK                      0x00020000
#define _ADCCSS1_CSS17_LENGTH                    0x00000001

#define _ADCCSS1_CSS18_POSITION                  0x00000012
#define _ADCCSS1_CSS18_MASK                      0x00040000
#define _ADCCSS1_CSS18_LENGTH                    0x00000001

#define _ADCCSS2_CSS43_POSITION                  0x0000000B
#define _ADCCSS2_CSS43_MASK                      0x00000800
#define _ADCCSS2_CSS43_LENGTH                    0x00000001

#define _ADCCSS2_CSS44_POSITION                  0x0000000C
#define _ADCCSS2_CSS44_MASK                      0x00001000
#define _ADCCSS2_CSS44_LENGTH                    0x00000001

#define _ADCDSTAT1_ARDY0_POSITION                0x00000000
#define _ADCDSTAT1_ARDY0_MASK                    0x00000001
#define _ADCDSTAT1_ARDY0_LENGTH                  0x00000001

#define _ADCDSTAT1_ARDY1_POSITION                0x00000001
#define _ADCDSTAT1_ARDY1_MASK                    0x00000002
#define _ADCDSTAT1_ARDY1_LENGTH                  0x00000001

#define _ADCDSTAT1_ARDY2_POSITION                0x00000002
#define _ADCDSTAT1_ARDY2_MASK                    0x00000004
#define _ADCDSTAT1_ARDY2_LENGTH                  0x00000001

#define _ADCDSTAT1_ARDY3_POSITION                0x00000003
#define _ADCDSTAT1_ARDY3_MASK                    0x00000008
#define _ADCDSTAT1_ARDY3_LENGTH                  0x00000001

#define _ADCDSTAT1_ARDY4_POSITION                0x00000004
#define _ADCDSTAT1_ARDY4_MASK                    0x00000010
#define _ADCDSTAT1_ARDY4_LENGTH                  0x00000001

#define _ADCDSTAT1_ARDY5_POSITION                0x00000005
#define _ADCDSTAT1_ARDY5_MASK                    0x00000020
#define _ADCDSTAT1_ARDY5_LENGTH                  0x00000001

#define _ADCDSTAT1_ARDY6_POSITION                0x00000006
#define _ADCDSTAT1_ARDY6_MASK                    0x00000040
#define _ADCDSTAT1_ARDY6_LENGTH                  0x00000001

#define _ADCDSTAT1_ARDY7_POSITION                0x00000007
#define _ADCDSTAT1_ARDY7_MASK                    0x00000080
#define _ADCDSTAT1_ARDY7_LENGTH                  0x00000001

#define _ADCDSTAT1_ARDY8_POSITION                0x00000008
#define _ADCDSTAT1_ARDY8_MASK                    0x00000100
#define _ADCDSTAT1_ARDY8_LENGTH                  0x00000001

#define _ADCDSTAT1_ARDY9_POSITION                0x00000009
#define _ADCDSTAT1_ARDY9_MASK                    0x00000200
#define _ADCDSTAT1_ARDY9_LENGTH                  0x00000001

#define _ADCDSTAT1_ARDY10_POSITION               0x0000000A
#define _ADCDSTAT1_ARDY10_MASK                   0x00000400
#define _ADCDSTAT1_ARDY10_LENGTH                 0x00000001

#define _ADCDSTAT1_ARDY11_POSITION               0x0000000B
#define _ADCDSTAT1_ARDY11_MASK                   0x00000800
#define _ADCDSTAT1_ARDY11_LENGTH                 0x00000001

#define _ADCDSTAT1_ARDY12_POSITION               0x0000000C
#define _ADCDSTAT1_ARDY12_MASK                   0x00001000
#define _ADCDSTAT1_ARDY12_LENGTH                 0x00000001

#define _ADCDSTAT1_ARDY13_POSITION               0x0000000D
#define _ADCDSTAT1_ARDY13_MASK                   0x00002000
#define _ADCDSTAT1_ARDY13_LENGTH                 0x00000001

